package com.example.aqtan.data

import com.example.aqtan.data.remote.dto.Category
import com.example.aqtan.data.remote.dto.HomeLists
import com.example.aqtan.data.remote.dto.Product

val saleProducts = listOf(
    Product(
        id = 35,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5,
        isSale = true
    ),
    Product(
        id = 34,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5,
        isSale = true
    ),
    Product(
        id = 33,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5,
        isSale = true
    ),
    Product(
        id = 32,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5,
        isSale = true
    ),
    Product(
        id = 31,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5,
        isSale = true
    ),
    Product(
        id = 30,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5,
        isSale = true
    ),
)

val products = listOf(
    Product(
        id = 0,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 1,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 2,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 3,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 4,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 5,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "T-shirts",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 6,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 7,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 8,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 9,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 10,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 11,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 12,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 13,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 14,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 15,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 16,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 17,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 18,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 19,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 20,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 21,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 22,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
    Product(
        id = 23,
        images = listOf(
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg",
            "https://m.media-amazon.com/images/I/81D1XEyh0mL._AC_SX679_.jpg",
            "https://m.media-amazon.com/images/I/71WcPwIvIYL._AC_SY879_.jpg"

        ),
        productName = "تيشرت البرق والرعد كاجوال جديد للشباب والرجال من ميزة",
        description = "معلومات عن السلعة\n" +
                "تصميم كاجوال عصري: استمتع بأناقة فريدة وراحة لا مثيل لها مع تيشيرت الرجال هذا، المصمم بقصات كاجوال تناسب أي مناسبة.\n" +
                "قماش عالي الجودة: مصنوع من مواد عالية الجودة، هذا التيشيرت يوفر لك الراحة طوال اليوم مع تحمل فترات الاستخدام الطويلة.\n" +
                "قصة متناسقة: يتميز بقصة مريحة تتناسب مع جسمك بشكل مثالي، مما يضيف لك إطلالة أنيقة وعصرية.\n" +
                "سهولة الصيانة: يمكن غسله بسهولة في الغسالة دون التأثير على جودته أو شكله.\n" +
                "تنوع في الاستخدام: مثالي للاستخدام اليومي، سواء كنت في العمل، المدرسة، التسوق، أو حتى في اللقاءات الاجتماعية.",
        price = 199.5
    ),
)

val tabItems = listOf(
    Category(-1,"all"),
    Category(1,  "T-shirts",),
    Category(2, "Crop tops",),
    Category(3,  "T-shirts",),
    Category(4, "Crop tops",),
    Category(5,  "T-shirts",),
    Category(6, "Crop tops",),
    Category(7,  "T-shirts",),
    Category(8, "Crop tops",),
    Category(9,  "T-shirts",),
    Category(10, "Crop tops",),
    Category(11, "Crop tops",),
    Category(12, "Crop tops",),

    )


val list = listOf(
    HomeLists(saleProducts,"Sale","Super summer sale"),
    HomeLists(products,"New","Your've never seen it before!")

)
